In [1]:
### Importing Libraries

import numpy as np
import pandas as pd

### Reading Dataset

In [2]:
df = pd.read_csv('daily-total-female-births-CA.csv', header=0)

In [3]:
df.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    365 non-null    object
 1   births  365 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.8+ KB

### Loading data with parse data

In [5]:
df2 = pd.read_csv('daily-total-female-births-CA.csv', header=0, parse_dates=[0])

In [6]:
df2.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    365 non-null    datetime64[ns]
 1   births  365 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.8 KB

### Loading Data as a Series

In [9]:
series = pd.read_csv('daily-total-female-births-CA.csv', header=0, parse_dates=[0], index_col=0, squeeze=True)

In [10]:
series.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

### Exploring Time Series Data

In [12]:
series.shape

(365,)

In [13]:
df2.shape

(365, 2)

### Quering by Time

In [14]:
print(series['1959-02'])

date
1959-02-01    23
1959-02-02    31
1959-02-03    44
1959-02-04    38
1959-02-05    50
1959-02-06    38
1959-02-07    51
1959-02-08    31
1959-02-09    31
1959-02-10    51
1959-02-11    36
1959-02-12    45
1959-02-13    51
1959-02-14    34
1959-02-15    52
1959-02-16    47
1959-02-17    45
1959-02-18    46
1959-02-19    39
1959-02-20    48
1959-02-21    37
1959-02-22    35
1959-02-23    52
1959-02-24    42
1959-02-25    45
1959-02-26    39
1959-02-27    37
1959-02-28    30
Name: births, dtype: int64

In [15]:
df2[(df2['date'] > '1959-02-01') & (df2['date'] <= '1959-02-28')]

         date  births
32 1959-02-02      31
33 1959-02-03      44
34 1959-02-04      38
35 1959-02-05      50
36 1959-02-06      38
37 1959-02-07      51
38 1959-02-08      31
39 1959-02-09      31
40 1959-02-10      51
41 1959-02-11      36
42 1959-02-12      45
43 1959-02-13      51
44 1959-02-14      34
45 1959-02-15      52
46 1959-02-16      47
47 1959-02-17      45
48 1959-02-18      46
49 1959-02-19      39
50 1959-02-20      48
51 1959-02-21      37
52 1959-02-22      35
53 1959-02-23      52
54 1959-02-24      42
55 1959-02-25      45
56 1959-02-26      39
57 1959-02-27      37
58 1959-02-28      30

### Descriptive Statistics

In [16]:
series.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: births, dtype: float64

In [17]:
df.describe()

           births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000